"use strict";

//================= Задача № 1 =================

// Напишите рекурсивную функцию, которая «переворачивает» строку.
// Пример: "hello" => "olleh"



//================= Задача № 2 =================

// Напишите рекурсивную функцию, которая вычисляет сумму натуральных чисел до числа 13.
// Пример: 1+2+3+4+5+6+7+8+9+10+11+12+13 = 91



//================= Задача № 3 =================

// Выведите в output число 110, полученное путём умножения числа 2 на каждое число от 1 до 10. Используйте рекурсию.
// 2*1 + 2*2 + 2*3 + 2*4 + 2*5 + 2*6 + 2*7 + 2*8 + 2*9 + 2*10 = 110


