"use strict";

//================= 1. Задача =================

// Создайте объект,
// где будет храниться информация по сэндвичу и выведите ее в консоль( начинка, цена, хлеб, сыр …). Подумайте, возможно ли хранить данные на все виды сэндвичей в одном объекте или в разных, что более удобно в дальнейшем использовании.
// Проверьте оба файла; 
// с кофе и сэндвичем на наличие в обоих файлах функций. Они нам понадобятся для следующего урока



//================= 2. Задача =================

// Проверьте оба файла; 
// с кофе и сэндвичем на наличие в обоих файлах функций. Они нам понадобятся для следующего урока




