"use strict";

//================= 1. Задача =================

// Создайте еще пару классов наследников, чтобы в итоге дойти до тигра Проши. Выведите все данные Проши и покажите его способности с помощью методов. 



//================= 2. Задача =================

// Напишите код для своего кафе в отдельной папке. Оформите код с помощью классов кофе, и желательно еще и сэндвича. Возможно добавите что-то свое, проанализируйте нужды возможного клиента.
// Сложите все файлы в одну папку. Это ваш итоговый проект, который можно и нужно залить на гитхаб (как минимум для практики). Презентуйте и покажите результаты своей  работы в вашей мини группе или любому человеку из команды (это поможет вам на интервью).

// Что может быть в ваших классах:


// Кофе:
// виды кофе
// рецепты кофе
// цены
// выбор стаканчика

//         Сэндвич:
//  начинка
// сыр
// типы сэндвичей
// типы хлеба
// цена сэндвича


// Кафе:
// оформление заказа
// имя заказчика
// из чего состоит заказ 
// цена общего заказа



//================= 3. Задача =================

// Составьте или дополните, если уже писали, краткую документацию к своему проекту, в отдельном файле или в виде комментарий внутри кода. Добавьте ее в Readme файл (этот пункт вы должны были взять на уроке по гиту, если нет, то оставьте на потом), идеально на английском, для тех , кто в штатах особенно.